app/controllers/players_controller.rb

SELECT * FROM "players"
---
  def index
    @players = Player.all

SELECT * FROM "players" WHERE ("players"."id" = 1)
SELECT * FROM "players"
---
  def show
    @player = Player.find(params[:id])
    @players = Player.all

SELECT * FROM "players" WHERE ("players"."id" = 1)
---
  def edit
    @player = Player.find(params[:id])

INSERT INTO "players" ("position", "draft_entry", "created_at", "pre_draft_team", "updated_at", "jersey_number", "weight", "early_entry", "rights_renounced", "draft_selection", "profile_img", "last_name", "height", "date_of_birth", "bio", "facebook", "draft_rights_trade", "current_agent", "first_name", "birthplace", "twitter") VALUES('Center', NULL, '2011-03-18 01:09:29', NULL, '2011-03-18 01:09:29', 21, '260', NULL, NULL, NULL, NULL, 'Lopez', '7-0 (213cm)', '2006-03-18', 'Brook Lopez was born in North Hollywood, Los Angeles to Deborah Ledford and his now-estranged father Heriberto Lopez, a native of Cuba.[citation needed] He was born into a life of basketball and art, as his grandfather played at the University of Colorado. Lopez moved from Hollywood to Oak Harbor, Washington while in second grade to be near his older brother, Alex, who was playing basketball at the University of Washington at the time. He moved to his current hometown of Fresno, California a year later, where he attended San Joaquin Memorial High School. While there, he played with his twin brother Robin Lopez, as well as Quincy Pondexter, a fellow NBA player for the New Orleans Hornets . Both teammates played with Lopez on their successful AAU team, the Elite Basketball Organization (EBO), along with Derrick Jasper and Tre''Von Willis, both of UNLV.
---
  def create
    @player = Player.new(params[:player])

    respond_to do |format|
      if @player.save

SELECT * FROM "players" WHERE ("players"."id" = 2)
UPDATE "players" SET "updated_at" = '2011-03-23 15:49:46', "bio" = 'Appeared in 76 games (all starts) averaging 18.7 points, 4.0 rebounds and 10.5 assists ... Named to the All-NBA Second Team ... Also selected as 2010 NBA All-Star, totaling 14 points and six assists in 28 minutes in Dallas ... Also competed in 2010 Skills Challenge during All-Star Weekend, finishing second to Steve Nash ... Recorded 48 games of 10+ assists ... Ranked second in league with 798 total assists and third in NBA with 10.5 per game ... Had 46 double-doubles ... Had 34 games of 20+ points ... Missed three games due to injury: two for a sprained/bruised right wrist (1/6-1/8) and one for right quadriceps contusion (2/22) ... Also missed three games for personal reasons (11/13/-11/14, 1/29) ... Had career-high 42 points with 10 assists (Arenas, Bryant, James once each), just fourth Jazz player to ever accomplish the feat (Maravich, Dantley, Green) ... Seventh occurrence by a Jazzman overall and first since Rickey Green vs. Denver (4/10/84) ... Had a season-high 19 assists vs. Golden State (3/31) ... Scored 35 points with 13 assists and seven rebounds vs. Houston (2/27) ... Narrowly missed first career triple-double, scoring 11 points with 13 assists and nine rebounds vs. L.A. Lakers (2/10) ', "facebook" = '', "twitter" = '' WHERE "id" = 2
---
  def update
    @player = Player.find(params[:id])

    respond_to do |format|
      if @player.update_attributes(params[:player])

SELECT * FROM "players" WHERE ("players"."id" = 3)
DELETE FROM "players" WHERE "id" = 3
---
  def destroy
    @player = Player.find(params[:id])
    @player.destroy